{
  "metadata": {
    "total_size": 267832344
  },
  "weight_map": {
    "classifier.bias": "model-00003-of-00003.safetensors",
    "classifier.weight": "model-00003-of-00003.safetensors",
    "distilbert.embeddings.LayerNorm.bias": "model-00001-of-00003.safetensors",
    "distilbert.embeddings.LayerNorm.weight": "model-00001-of-00003.safetensors",
    "distilbert.embeddings.position_embeddings.weight": "model-00001-of-00003.safetensors",
    "distilbert.embeddings.word_embeddings.weight": "model-00001-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.k_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.k_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.out_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.out_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.q_lin.bias": "model-00001-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.q_lin.weight": "model-00001-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.v_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.attention.v_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.ffn.lin1.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.ffn.lin1.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.ffn.lin2.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.ffn.lin2.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.output_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.output_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.sa_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.0.sa_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.k_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.k_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.out_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.out_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.q_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.q_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.v_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.attention.v_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.ffn.lin1.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.ffn.lin1.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.ffn.lin2.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.ffn.lin2.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.output_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.output_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.sa_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.1.sa_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.k_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.k_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.out_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.out_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.q_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.q_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.v_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.attention.v_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.ffn.lin1.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.ffn.lin1.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.ffn.lin2.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.ffn.lin2.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.output_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.output_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.sa_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.2.sa_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.k_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.k_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.out_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.out_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.q_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.q_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.v_lin.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.attention.v_lin.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.ffn.lin1.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.ffn.lin1.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.ffn.lin2.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.ffn.lin2.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.output_layer_norm.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.output_layer_norm.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.3.sa_layer_norm.bias": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.3.sa_layer_norm.weight": "model-00002-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.k_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.k_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.out_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.out_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.q_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.q_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.v_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.attention.v_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.ffn.lin1.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.ffn.lin1.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.ffn.lin2.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.ffn.lin2.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.output_layer_norm.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.output_layer_norm.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.sa_layer_norm.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.4.sa_layer_norm.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.k_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.k_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.out_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.out_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.q_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.q_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.v_lin.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.attention.v_lin.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.ffn.lin1.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.ffn.lin1.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.ffn.lin2.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.ffn.lin2.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.output_layer_norm.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.output_layer_norm.weight": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.sa_layer_norm.bias": "model-00003-of-00003.safetensors",
    "distilbert.transformer.layer.5.sa_layer_norm.weight": "model-00003-of-00003.safetensors",
    "pre_classifier.bias": "model-00003-of-00003.safetensors",
    "pre_classifier.weight": "model-00003-of-00003.safetensors"
  }
}
